OpenFOAM-v1812/tutorials/lagrangian/sprayFoam/aachenBomb/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sprayFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          2.5e-06;

writeControl    adjustableRunTime;

writeInterval   5e-05;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.1;

runTimeModifiable yes;

functions
{
    distribtion1
    {
        type            particleDistribution;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        cloud           sprayCloud;
        nameVsBinWidth
        (
            (d 1e-5)
            (U 10)
        );
        setFormat       raw;
    }
}


// ************************************************************************* //
